Revit 2024 API
ParameterTypeId.FamilyAutojoin Property
 "Automatically joins geometry to walls"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyAutojoin { get; }
Visual Basic
Public Shared ReadOnly Property FamilyAutojoin As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyAutojoin {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace